thesis_charts_app/thesis_charts_app/app/controllers/answers_controller.rb

INSERT INTO "answers" ("participant_id", "computer_uuid", "chart_type", "data_source", "test_phase", "session_index", "session_type", "session_start_time", "number_of_charts", "is_dynamic", "transition_after", "unique_chart_index", "unique_chart_state", "trigger_time", "transition_started", "click_time", "participant_answer_index", "participant_answer_state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20) RETURNING "id"
---
  def record
    answer = Answer.new

    answer.participant_id           = params[:participantId]
    answer.computer_uuid            = params[:computerUuid]
    answer.chart_type               = params[:chartType]
    answer.data_source              = params[:dataSource]
    answer.test_phase               = params[:testPhase]
    answer.session_index            = params[:sessionIndex]
    answer.session_type             = params[:sessionType]
    answer.session_start_time       = params[:sessionStartTime]
    answer.number_of_charts         = params[:numberOfCharts]
    answer.is_dynamic               = params[:isDynamic]
    answer.transition_after         = params[:transitionAfter]
    answer.unique_chart_index       = params[:uniqueChartIndex]
    answer.unique_chart_state       = params[:uniqueChartState]
    answer.trigger_time             = params[:triggerTime]
    answer.transition_started       = params[:transitionStarted]
    answer.click_time               = params[:clickTime]
    answer.participant_answer_index = params[:participantAnswerIndex]
    answer.participant_answer_state = params[:participantAnswerState]
    answer.sequential_chart_answers = params[:sequentialChartAnswers]

    if answer.save